Logdir : /usr/users/sdim/sdim_9/DeepLearning/pytorch_template_code/logs/PollenNet_44
## Command 
/tmp/sdim_9-153010/code/venv/lib/python3.10/site-packages/torchtmpl/main.py /usr/users/sdim/sdim_9/DeepLearning/pytorch_template_code/configs/tmpm15pyqlq-config.yml launch_agent

 Config : {'data': {'batch_size': 128, 'is_batch_weighted': False, 'num_workers': 8, 'testpath': '/mounts/datasets/datasets/2025-ZooCamChallenge/test', 'trainpath': '/mounts/datasets/datasets/2025-ZooCamChallenge/train', 'valid_ratio': 0.2}, 'logging': {'logdir': '~/DeepLearning/pytorch_template_code/logs', 'save_dir': '/usr/users/sdim/sdim_9/DeepLearning/pytorch_template_code/test'}, 'loss': {'gamma': 1.092705563750044, 'is_weighted': False, 'lossname': 'CrossEntropyLoss'}, 'model': {'class': 'PollenNet', 'num_layers': 5, 'pretrained_in_color': True, 'prob_droupout': 0.28163534557606207, 'size_linear': 1024}, 'optim': {'algo': 'AdamW', 'params': {'amsgrad': False, 'lr': 2.124999366849727e-05, 'weight_decay': 0.017700182101226123}}, 'train': {'is_weighted': False, 'nepochs': 128, 'test_end_train': True}} 

 Wandb run name : lilac-sweep-5

## Summary of the model architecture
==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
Sequential                               [128, 86]                 --
├─Sequential: 1-1                        [128, 512, 1, 1]          --
│    └─Conv2d: 2-1                       [128, 32, 128, 128]       320
│    └─ReLU: 2-2                         [128, 32, 128, 128]       --
│    └─MaxPool2d: 2-3                    [128, 32, 64, 64]         --
│    └─BatchNorm2d: 2-4                  [128, 32, 64, 64]         64
│    └─Conv2d: 2-5                       [128, 64, 64, 64]         18,496
│    └─ReLU: 2-6                         [128, 64, 64, 64]         --
│    └─MaxPool2d: 2-7                    [128, 64, 32, 32]         --
│    └─BatchNorm2d: 2-8                  [128, 64, 32, 32]         128
│    └─Dropout: 2-9                      [128, 64, 32, 32]         --
│    └─Conv2d: 2-10                      [128, 128, 32, 32]        73,856
│    └─ReLU: 2-11                        [128, 128, 32, 32]        --
│    └─MaxPool2d: 2-12                   [128, 128, 16, 16]        --
│    └─BatchNorm2d: 2-13                 [128, 128, 16, 16]        256
│    └─Dropout: 2-14                     [128, 128, 16, 16]        --
│    └─Conv2d: 2-15                      [128, 256, 16, 16]        295,168
│    └─ReLU: 2-16                        [128, 256, 16, 16]        --
│    └─MaxPool2d: 2-17                   [128, 256, 8, 8]          --
│    └─BatchNorm2d: 2-18                 [128, 256, 8, 8]          512
│    └─Dropout: 2-19                     [128, 256, 8, 8]          --
│    └─Conv2d: 2-20                      [128, 512, 8, 8]          1,180,160
│    └─ReLU: 2-21                        [128, 512, 8, 8]          --
│    └─MaxPool2d: 2-22                   [128, 512, 4, 4]          --
│    └─BatchNorm2d: 2-23                 [128, 512, 4, 4]          1,024
│    └─Dropout: 2-24                     [128, 512, 4, 4]          --
│    └─AdaptiveAvgPool2d: 2-25           [128, 512, 1, 1]          --
├─Flatten: 1-2                           [128, 512]                --
├─Linear: 1-3                            [128, 1024]               525,312
├─ReLU: 1-4                              [128, 1024]               --
├─Dropout: 1-5                           [128, 1024]               --
├─Linear: 1-6                            [128, 86]                 88,150
==========================================================================================
Total params: 2,183,446
Trainable params: 2,183,446
Non-trainable params: 0
Total mult-adds (G): 39.47
==========================================================================================
Input size (MB): 8.39
Forward/backward pass size (MB): 1301.37
Params size (MB): 8.73
Estimated Total Size (MB): 1318.49
==========================================================================================

## Loss

CrossEntropyLoss()

## Datasets : 
Train : Dataset ImageFolder
    Number of datapoints: 1093785
    Root location: /mounts/datasets/datasets/2025-ZooCamChallenge/train
    StandardTransform
Transform: Compose(
               Grayscale(num_output_channels=1)
               Resize(size=(128, 128), interpolation=bilinear, max_size=None, antialias=True)
               ToTensor()
           )
Validation : Dataset ImageFolder
    Number of datapoints: 1093785
    Root location: /mounts/datasets/datasets/2025-ZooCamChallenge/train
    StandardTransform
Transform: Compose(
               Grayscale(num_output_channels=1)
               Resize(size=(128, 128), interpolation=bilinear, max_size=None, antialias=True)
               ToTensor()
           )